from pd_gain_optimizer import PDGainOptimizer
from shapely.geometry import Point, Polygon
import numpy as np

def balance_cost(data, com_init_height):
    # COM(重心)　z
    com_z = np.array(data.subtree_com[0])[2]

    height_cost = (com_init_height - com_z) ** 2

    # energy_cost = np.sum(u**2)

    # return height_cost + 0.01 * energy_cost

    return height_cost

if __name__ == "__main__":
    # --- モデル情報 ---
    model_path = "myo_sim/gait2354/gait2354_simbody_cvt3.xml"
    muscles = [
        "glut_med1_r", "glut_med2_r", "glut_med3_r",
        "bifemlh_r", "bifemsh_r", "sar_r", "add_mag2_r", "tfl_r", "pect_r", "grac_r",
        "glut_max1_r", "glut_max2_r", "glut_max3_r",
        "iliacus_r", "psoas_r", "quad_fem_r", "gem_r", "peri_r",
        "rect_fem_r", "vas_int_r", "med_gas_r", "soleus_r", "tib_post_r", "tib_ant_r",

        "glut_med1_l", "glut_med2_l", "glut_med3_l",
        "bifemlh_l", "bifemsh_l", "sar_l", "add_mag2_l", "tfl_l", "pect_l", "grac_l",
        "glut_max1_l", "glut_max2_l", "glut_max3_l",
        "iliacus_l", "psoas_l", "quad_fem_l", "gem_l", "peri_l",
        "rect_fem_l", "vas_int_l", "med_gas_l", "soleus_l", "tib_post_l", "tib_ant_l",

        "ercspn_r", "ercspn_l",
        "intobl_r", "intobl_l",
        "extobl_r", "extobl_l"
    ]

    x0 = [
        8.84563537e-01, 5.73444232e+00, 8.76278729e-01, 6.80615845e+00,
        2.64427094e+00, 3.73049843e+00, 1.22059318e+01, 3.45261430e+00,
        1.10810310e+00, 7.73085297e+00, 2.45279485e+00, 1.23839641e+00,
        4.89610104e+00, 5.17237776e+00, 4.23093060e+00, 2.88186148e+00,
        4.60931830e+00, 8.35412374e+00, 1.19504971e+01, 1.40778338e+00,
        1.17049076e-02, 3.63990254e-01, 6.52220548e+00, 4.57889402e-01,
        2.14966239e+00, 9.39417556e+00, 6.23332375e+00, 8.92566389e+00,
        8.73772895e+00, 1.75784759e+00, 9.23764547e+00, 5.42661100e+00,
        1.61405125e+01, 3.47940256e+00, 5.29054840e+00, 1.11912460e+01,
        2.95997831e+00, 4.27502202e-01, 9.03659016e+00, 2.06124736e+00,
        1.99581924e+00, 1.19415063e+00, 5.01823190e+00, 6.35854041e+00,
        1.08931543e+00, 9.81087912e-03, 5.96971103e+00, 1.40859694e+00,
        5.77664433e-03, 6.46275669e+00, 1.86912286e+00, 1.11610510e+01,
        1.06135691e+01, 1.09961242e+01, 6.50973700e+00, 1.19691657e+00,
        9.11625849e-02, 7.68799441e+00, 5.14359276e+00, 4.37027650e+00,
        1.60582370e+01, 7.73437491e+00, 5.33166931e-01, 3.01598209e+00,
        5.21200017e+00, 1.07699006e+01, 1.11603922e+01, 2.83854029e+00,
        7.45184250e-01, 1.17375574e+01, 8.36365941e+00, 6.76507161e-01,
        4.10656432e-01, 5.63733824e+00, 1.08555905e-02, 2.74706327e-02,
        4.00803188e-01, 6.75151266e+00, 1.79251393e-03, 1.38119084e+00,
        1.59907222e+00, 3.74329036e+00, 2.27386998e+00, 4.27874485e-01,
        2.26147899e+01, 3.07252895e+00, 3.07330506e+00, 1.05656225e+01,
        1.74678380e+01, 8.55047280e+00, 1.52454391e+01, 1.11215542e+01,
        5.64565705e-01, 7.86151134e+00, 8.60078715e+00, 1.65244895e+00,
        4.26553362e+00, 3.76527694e+00, 6.62419916e-03, 1.30739130e-03,
        8.89482745e-02, 1.54897926e+00, 7.83140271e+00, 2.07562319e+01,
        1.35350780e+01, 5.89643903e+00, 1.29840244e+01, 8.55810903e+00,
        0.12127547,0.13123308,0.10958298,0.42012235,0.24598156,0.56902982,
        0.19174765,0.53559821,0.1037014,0.44016625,0.19993818,0.20950695,
        0.23493564,0.20702685,0.26094547,0.0695663,0.06439161,0.13634581,
        0.47584712,0.1827869,0.45015658,0.29139796,0.34537915,0.30378508,
        0.12127547,0.13123308,0.10958298,0.42012235,0.24598156,0.56902982,
        0.19174765,0.53559821,0.1037014,0.44016625,0.19993818,0.20950695,
        0.23493564,0.20696308,0.26094547,0.0695663,0.06439161,0.13634581,
        0.47584709,0.18278657,0.45015658,0.29139796,0.34537915,0.30378508,
        0.14970805,0.14970805,0.19909603,0.19909603,0.2740593,0.2740593
    ]


    optimizer = PDGainOptimizer(model_path, muscles, sim_steps=250, model_name="gait2354_v3", output_dir="results", cost_fn=balance_cost)

    # CMA-ES による最適化（1000世代）
    best_params = optimizer.optimize(x0=x0, sigma0=1.0, maxiter=1000, delay_time=0.0, noise_std=0.0)
    print("最適化されたパラメータ:", best_params)

    # 最適化されたゲインでレンダリング付きシミュレーション
    optimizer.run_simulation(best_params, render=True, plot=False)

    num_muscles = len(muscles)
    Kp_opt = best_params[:num_muscles]
    Kd_opt = best_params[num_muscles:]
    print("最適化された Kp:", Kp_opt)
    print("最適化された Kd:", Kd_opt)